import React, { Component } from 'react'

export class Content extends React.Component {
  constructor(props) {
    super(props)
    this.changeColor = this.changeColor.bind(this)
  }

  changeColor(event) {
    event.target.style.background = this.getRandomColor()
    event.target.style.color = this.getRandomColor()
  }

  getRandomColor() {
    var letters = '0123456789ABCDEF'
    var color = '#'
    for (var i = 0; i < 6; i++) {
      color += letters[Math.floor(Math.random() * 16)]
    }
    return color
  }

  render() {
    return (
      <>
        <h2 onClick={this.changeColor}>Чапча Святослав Олександрович</h2>
        <h3 onClick={this.changeColor}>Дата народження: </h3>
        <p>29 травня 2003 рік</p>
        <h3>Місце народження: </h3>
        <p>м. Краматорськ</p>
        <h3>Освіта: </h3>
        <p>
          Повна середня - Слов`янська Гімназія, м. Київ
          <br />
          Неповна вища - НТУУ "КПІ", м. Київ
        </p>
        <h3>Хобі:</h3>
        <ul>
          <li>Кінематограф</li>
          <li>Музика</li>
          <li>Відеоігри</li>
          <li>Велоспорт</li>
          <li>Книги</li>
        </ul>
        <h3>Улюблені серіали: </h3>
        <ol>
          <li>Supernatural (2005-2020)</li>
          <li>Game Of Thrones (2011-2019)</li>
          <li>The Walking Dead (2010-2022)</li>
        </ol>
        <h3>Улюблене місто:</h3>
        <p>
          Денвер - жваве, культурне і поглинене собою місто в США; столиця штату
          Колорадо. Блискучі хмарочоси центру міста та історичні райони LoDo
          заповнені броварнями. Тут найкраща «кулінарна сцена» між Чикаго та
          Каліфорнією. На додачу – 12-метрова скульптура блакитного ведмедя та
          18-метрові танцюристи. На аренах стадіонів Invesco Field at Mile High
          та Coors Field "хоумрани", жести "дай п'ять" та натовпи шалених
          спортивних фанатів - майже щовечірнє шоу. Дорога в далечінь, високий
          туман і розріджене повітря – зубчаста пурпурна лінія Передового
          хребта, ворота у світ незайманої природи, чи не найдивовижнішої на
          континенті. Словом, є безліч речей, якими можна зайнятися у Денвері.
          <br />
          <br />
          Місто компактне, люди доброзичливі. Розташований рівно на висоті 1609
          метрів (1 миля: звідси і назва «Місто заввишки в милю»), колишній
          залізничний вузол Дикого Заходу – чудове місце, щоб акліматизуватися.
          Тут низька вологість і рясно сонячне світло.
        </p>
      </>
    )
  }
}
